app/views/events/_form.html.erb

SELECT "companies".* FROM "companies"
---
       <%=f.label :company_id, 'Company Name' %><br>
       <%=f.collection_select(:company_id, Company.all, :id, :name, prompt: true) %>

SELECT "employees".* FROM "employees"  ORDER BY lName, fName
---
       <%#<%= f.text_field :responsibleParty %>
       <%=f.collection_select(:employee_id, Employee.all, :id, :lName, prompt: true) %>