app/views/events/show.html.erb


  <% a = Employee.find(x) %>
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 1]]