app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "CSA"], ["notes", "Continental Shelf Associates"], ["created_at", "2016-02-25 16:03:50.902681"], ["updated_at", "2016-02-25 16:03:50.902681"]]
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save