app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"  ORDER BY employees.lName DESC, "employees"."lName" ASC
---
  def index
   # @employees = Employee.all
   #cn.. sort by lastname when you select all the employees
    @employees = Employee.order('employees.lName DESC').all

INSERT INTO "employees" ("fName", "lName", "phone", "email", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "fName" = ?, "lName" = ?, "phone" = ?, "email" = ?, "notes" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["fName", "Patrick"], ["lName", "Lyons"], ["phone", "x3046"], ["email", "p.lyons@conshelf.com"], ["notes", "cell phone - 772.932.1101"], ["updated_at", "2016-03-11 19:57:27.986926"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)