app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("issuer", "deficiency", "affectedArea", "eventSource", "status", "cost", "notes", "employee_id", "company_id", "rac", "correctiveAction", "refAuthority", "date", "targetDate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "affectedArea" = ?, "rac" = ?, "refAuthority" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["affectedArea", "hdghjfgh"], ["rac", "Extra High"], ["refAuthority", "dwegdfh"], ["updated_at", "2016-03-11 17:32:57.629553"], ["id", 20]]